test-repo/macros/Helpers/RealizarRequestCollect.yaml

description: Preparar y realizar request PaymentsCollect
actions:
  
  - script: |
      var lineaAgente = "0" + $macroArgs.lineaAgente;
      $localData.lineaAgente = lineaAgente
      var lineaSuscriptor = "0" + $macroArgs.lineaSuscriptor;
      $localData.lineaSuscriptor = lineaSuscriptor

  - description: Construir el request
    action: org.getopentest.actions.Format
    args:
      template: |
        <S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
          <SOAP-ENV:Header/>
          <S:Body xmlns="http://xmlns.tigo.com/MFS/MFSServiceResponse/V2/schema" xmlns:ns2="http://xmlns.tigo.com/RequestHeader/V3" xmlns:ns3="http://xmlns.tigo.com/MFS/MFSServiceRequest/V2/schema" xmlns:ns4="http://xmlns.tigo.com/ParameterType/V2" xmlns:ns5="http://xmlns.tigo.com/ResponseHeader/V3">
              <ns3:mfsCollectRequest>
                <ns2:RequestHeader>
                    <ns2:GeneralConsumerInformation>
                      <ns2:consumerID>AZKS</ns2:consumerID>
                      <ns2:transactionID>000052</ns2:transactionID>
                      <ns2:country>PRY</ns2:country>
                      <ns2:correlationID>${$macroArgs.correlationid}</ns2:correlationID>
                    </ns2:GeneralConsumerInformation>
                </ns2:RequestHeader>
                <ns3:requestBody>
                    <ns3:msisdn>${$localData.lineaSuscriptor}</ns3:msisdn>
                    <ns3:pin xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                    <ns3:agentId>${$localData.lineaAgente}</ns3:agentId>
                    <ns3:agentPin>${$macroArgs.pinAgente}</ns3:agentPin>
                    <ns3:priceModel></ns3:priceModel>
                    <ns3:amount>${$macroArgs.monto}</ns3:amount>
                    <ns3:additionalParameters>
                      <ns4:ParameterType>
                          <ns4:parameterName>COMERCIO</ns4:parameterName>
                          <ns4:parameterValue>SUPERMERCADO PRYCA</ns4:parameterValue>
                      </ns4:ParameterType>
                      <ns4:ParameterType>
                          <ns4:parameterName>CODIGO_COMERCIO</ns4:parameterName>
                          <ns4:parameterValue>0702858</ns4:parameterValue>
                      </ns4:ParameterType>
                    </ns3:additionalParameters>
                </ns3:requestBody>
              </ns3:mfsCollectRequest>
          </S:Body>
        </S:Envelope>

  - script: |
      var response = $output.text

  - script: |
      var horaInicio = new Date();
      $log.error("HORA DE INICIO DE LANAZAMIENTO DE REQUEST COLLECT: "+ horaInicio.toTimeString())

  - description: Realizar el SOAP Request
    action: org.getopentest.actions.HttpRequest
    args:
      url: http://vproxy-qa-osb12.telecel.net.py:80/osb/Platforms/MFS/Payments/V2
      verb: POST
      headers:
        Content-Type: application/soap+xml; charset=utf-8
      body: $script response

  - description: Verificar el caso de prueba
    script: |
      var responseBody = $json($output.body);
      if(responseBody.indexOf("Ejecucion exitosa") > -1){
        $log.error("LA PRUEBA FUE EXITOSA");
      }else{
        $fail("LA PRUEBA NO FUE EXITOSA (VERIFICAR LOG MAS ARRIBA)");
      }